{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"Model": "Functional", "config": {"name": "model_20", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_21"}, "name": "input_21", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_382", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_382", "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_380", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_380", "inbound_nodes": [[["conv2d_382", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_380", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_380", "inbound_nodes": [[["batch_normalization_380", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_120", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_120", "inbound_nodes": [["re_lu_380", 0, 0, {"name": "input"}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_385", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_385", "inbound_nodes": [[["tf.identity_120", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_383", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_383", "inbound_nodes": [[["conv2d_385", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_383", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_383", "inbound_nodes": [[["batch_normalization_383", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_386", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_386", "inbound_nodes": [[["re_lu_383", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_387", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_387", "inbound_nodes": [[["tf.identity_120", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_384", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_384", "inbound_nodes": [[["conv2d_386", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_385", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_385", "inbound_nodes": [[["conv2d_387", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_384", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_384", "inbound_nodes": [[["batch_normalization_384", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_385", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_385", "inbound_nodes": [[["batch_normalization_385", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_60", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_60", "inbound_nodes": [["re_lu_384", 0, 0, {"y": ["re_lu_385", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_383", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_383", "inbound_nodes": [[["tf.identity_120", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_388", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_388", "inbound_nodes": [[["tf.math.add_60", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_381", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_381", "inbound_nodes": [[["conv2d_383", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_386", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_386", "inbound_nodes": [[["conv2d_388", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_381", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_381", "inbound_nodes": [[["batch_normalization_381", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_386", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_386", "inbound_nodes": [[["batch_normalization_386", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_384", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_384", "inbound_nodes": [[["re_lu_381", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.slice_60", "trainable": true, "dtype": "float32", "function": "slice"}, "name": "tf.slice_60", "inbound_nodes": [["re_lu_386", 0, 0, {"begin": [0, 0, 0, 0], "size": [-1, 42, -1, -1]}]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_382", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_382", "inbound_nodes": [[["conv2d_384", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_120", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_120", "inbound_nodes": [[["tf.slice_60", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_382", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_382", "inbound_nodes": [[["batch_normalization_382", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_121", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_121", "inbound_nodes": [[["max_pooling2d_120", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_60", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_60", "inbound_nodes": [[["re_lu_382", 0, 0, {"axis": 1}], ["re_lu_386", 0, 0, {"axis": 1}], ["max_pooling2d_121", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_121", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_121", "inbound_nodes": [["tf.concat_60", 0, 0, {"name": "output"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_122", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_122", "inbound_nodes": [["tf.identity_121", 0, 0, {"name": "input"}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_391", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_391", "inbound_nodes": [[["tf.identity_122", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_389", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_389", "inbound_nodes": [[["conv2d_391", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_389", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_389", "inbound_nodes": [[["batch_normalization_389", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_392", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_392", "inbound_nodes": [[["re_lu_389", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_393", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_393", "inbound_nodes": [[["tf.identity_122", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_390", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_390", "inbound_nodes": [[["conv2d_392", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_391", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_391", "inbound_nodes": [[["conv2d_393", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_390", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_390", "inbound_nodes": [[["batch_normalization_390", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_391", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_391", "inbound_nodes": [[["batch_normalization_391", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_61", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_61", "inbound_nodes": [["re_lu_390", 0, 0, {"y": ["re_lu_391", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_389", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_389", "inbound_nodes": [[["tf.identity_122", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_394", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_394", "inbound_nodes": [[["tf.math.add_61", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_387", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_387", "inbound_nodes": [[["conv2d_389", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_392", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_392", "inbound_nodes": [[["conv2d_394", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_387", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_387", "inbound_nodes": [[["batch_normalization_387", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_392", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_392", "inbound_nodes": [[["batch_normalization_392", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_390", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_390", "inbound_nodes": [[["re_lu_387", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.slice_61", "trainable": true, "dtype": "float32", "function": "slice"}, "name": "tf.slice_61", "inbound_nodes": [["re_lu_392", 0, 0, {"begin": [0, 0, 0, 0], "size": [-1, 42, -1, -1]}]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_388", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_388", "inbound_nodes": [[["conv2d_390", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_122", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_122", "inbound_nodes": [[["tf.slice_61", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_388", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_388", "inbound_nodes": [[["batch_normalization_388", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_123", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_123", "inbound_nodes": [[["max_pooling2d_122", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_61", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_61", "inbound_nodes": [[["re_lu_388", 0, 0, {"axis": 1}], ["re_lu_392", 0, 0, {"axis": 1}], ["max_pooling2d_123", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_123", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_123", "inbound_nodes": [["tf.concat_61", 0, 0, {"name": "output"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_124", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_124", "inbound_nodes": [["tf.identity_123", 0, 0, {"name": "input"}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_397", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_397", "inbound_nodes": [[["tf.identity_124", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_395", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_395", "inbound_nodes": [[["conv2d_397", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_395", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_395", "inbound_nodes": [[["batch_normalization_395", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_398", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_398", "inbound_nodes": [[["re_lu_395", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_399", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_399", "inbound_nodes": [[["tf.identity_124", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_396", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_396", "inbound_nodes": [[["conv2d_398", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_397", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_397", "inbound_nodes": [[["conv2d_399", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_396", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_396", "inbound_nodes": [[["batch_normalization_396", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_397", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_397", "inbound_nodes": [[["batch_normalization_397", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_62", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_62", "inbound_nodes": [["re_lu_396", 0, 0, {"y": ["re_lu_397", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_395", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_395", "inbound_nodes": [[["tf.identity_124", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_400", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_400", "inbound_nodes": [[["tf.math.add_62", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_393", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_393", "inbound_nodes": [[["conv2d_395", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_398", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_398", "inbound_nodes": [[["conv2d_400", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_393", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_393", "inbound_nodes": [[["batch_normalization_393", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_398", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_398", "inbound_nodes": [[["batch_normalization_398", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_396", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_396", "inbound_nodes": [[["re_lu_393", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.slice_62", "trainable": true, "dtype": "float32", "function": "slice"}, "name": "tf.slice_62", "inbound_nodes": [["re_lu_398", 0, 0, {"begin": [0, 0, 0, 0], "size": [-1, 42, -1, -1]}]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_394", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_394", "inbound_nodes": [[["conv2d_396", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_124", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_124", "inbound_nodes": [[["tf.slice_62", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_394", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_394", "inbound_nodes": [[["batch_normalization_394", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_125", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_125", "inbound_nodes": [[["max_pooling2d_124", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_62", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_62", "inbound_nodes": [[["re_lu_394", 0, 0, {"axis": 1}], ["re_lu_398", 0, 0, {"axis": 1}], ["max_pooling2d_125", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_125", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_125", "inbound_nodes": [["tf.concat_62", 0, 0, {"name": "output"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_20", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_20", "inbound_nodes": [["tf.identity_125", 0, 0, {"axis": [1, 2]}]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["tf.math.reduce_mean_20", 0, 0, {}]]]}], "input_layers": [["input_21", 0, 0]], "output_layers": [["dense_20", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_380/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_380/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_380/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_380/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_381/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_381/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_381/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_381/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_382/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_382/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_382/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_382/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_383/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_383/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_383/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_383/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_384/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_384/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_384/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_384/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_385/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_385/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_385/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_385/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_386/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_386/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_386/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_386/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_387/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_387/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_387/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_387/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_388/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_388/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_388/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_388/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_389/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_389/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_389/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_389/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_390/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_390/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_390/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_390/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_391/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_391/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_391/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_391/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_392/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_392/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_392/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_392/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_393/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_393/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_393/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_393/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_394/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_394/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_394/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_394/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_395/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_395/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_395/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_395/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_396/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_396/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_396/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_396/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_397/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_397/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_397/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_397/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_398/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_398/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_398/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_398/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "conv2d_382/kernel", "shape": [3, 3, 1, 128], "dtype": "float32"}, {"name": "conv2d_383/kernel", "shape": [1, 1, 28, 43], "dtype": "float32"}, {"name": "conv2d_384/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_385/kernel", "shape": [1, 1, 28, 43], "dtype": "float32"}, {"name": "conv2d_386/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_387/kernel", "shape": [1, 1, 28, 43], "dtype": "float32"}, {"name": "conv2d_388/kernel", "shape": [1, 1, 43, 43], "dtype": "float32"}, {"name": "conv2d_389/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_390/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_391/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_392/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_393/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_394/kernel", "shape": [1, 1, 43, 43], "dtype": "float32"}, {"name": "conv2d_395/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_396/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_397/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_398/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_399/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_400/kernel", "shape": [1, 1, 43, 43], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [10], "dtype": "float32"}]}]}