{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_12", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_234", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_234", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_234", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_234", "inbound_nodes": [[["conv2d_234", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_234", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_234", "inbound_nodes": [[["batch_normalization_234", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_114", "trainable": true, "dtype": "float32"}, "name": "add_114", "inbound_nodes": [[["re_lu_234", 0, 0, {}], ["re_lu_234", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.negative_15", "trainable": true, "dtype": "float32", "function": "math.negative"}, "name": "tf.math.negative_15", "inbound_nodes": [["re_lu_234", 0, 0, {"name": null}]]}, {"class_name": "Add", "config": {"name": "add_115", "trainable": true, "dtype": "float32"}, "name": "add_115", "inbound_nodes": [[["add_114", 0, 0, {}], ["tf.math.negative_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_235", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_235", "inbound_nodes": [[["add_115", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_235", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_235", "inbound_nodes": [[["conv2d_235", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_235", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_235", "inbound_nodes": [[["batch_normalization_235", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_65", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_65", "inbound_nodes": [[["re_lu_235", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_66", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_66", "inbound_nodes": [[["max_pooling2d_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_236", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_236", "inbound_nodes": [[["max_pooling2d_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_236", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_236", "inbound_nodes": [[["conv2d_236", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_236", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_236", "inbound_nodes": [[["batch_normalization_236", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_237", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_237", "inbound_nodes": [[["re_lu_236", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_237", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_237", "inbound_nodes": [[["conv2d_237", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_238", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_238", "inbound_nodes": [[["add_115", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_237", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_237", "inbound_nodes": [[["batch_normalization_237", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_238", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_238", "inbound_nodes": [[["conv2d_238", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.slice", "trainable": true, "dtype": "float32", "function": "slice"}, "name": "tf.slice", "inbound_nodes": [["re_lu_237", 0, 0, {"begin": [0, 0, 0, 0], "size": [-1, 42, -1, -1]}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_238", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_238", "inbound_nodes": [[["batch_normalization_238", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_116", "trainable": true, "dtype": "float32"}, "name": "add_116", "inbound_nodes": [[["tf.slice", 0, 0, {}], ["re_lu_238", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_239", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_239", "inbound_nodes": [[["add_116", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_239", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_239", "inbound_nodes": [[["conv2d_239", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_239", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_239", "inbound_nodes": [[["batch_normalization_239", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_15", "inbound_nodes": [[["max_pooling2d_66", 0, 0, {}], ["re_lu_237", 0, 0, {}], ["re_lu_239", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_117", "trainable": true, "dtype": "float32"}, "name": "add_117", "inbound_nodes": [[["concatenate_15", 0, 0, {}], ["concatenate_15", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.negative_16", "trainable": true, "dtype": "float32", "function": "math.negative"}, "name": "tf.math.negative_16", "inbound_nodes": [["concatenate_15", 0, 0, {"name": null}]]}, {"class_name": "Add", "config": {"name": "add_118", "trainable": true, "dtype": "float32"}, "name": "add_118", "inbound_nodes": [[["add_117", 0, 0, {}], ["tf.math.negative_16", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_119", "trainable": true, "dtype": "float32"}, "name": "add_119", "inbound_nodes": [[["add_118", 0, 0, {}], ["add_118", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.negative_17", "trainable": true, "dtype": "float32", "function": "math.negative"}, "name": "tf.math.negative_17", "inbound_nodes": [["add_118", 0, 0, {"name": null}]]}, {"class_name": "Add", "config": {"name": "add_120", "trainable": true, "dtype": "float32"}, "name": "add_120", "inbound_nodes": [[["add_119", 0, 0, {}], ["tf.math.negative_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_240", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_240", "inbound_nodes": [[["add_120", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_240", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_240", "inbound_nodes": [[["conv2d_240", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_240", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_240", "inbound_nodes": [[["batch_normalization_240", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_67", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_67", "inbound_nodes": [[["re_lu_240", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_68", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_68", "inbound_nodes": [[["max_pooling2d_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_241", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_241", "inbound_nodes": [[["max_pooling2d_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_241", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_241", "inbound_nodes": [[["conv2d_241", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_241", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_241", "inbound_nodes": [[["batch_normalization_241", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_242", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_242", "inbound_nodes": [[["re_lu_241", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_242", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_242", "inbound_nodes": [[["conv2d_242", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_243", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_243", "inbound_nodes": [[["add_120", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_242", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_242", "inbound_nodes": [[["batch_normalization_242", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_243", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_243", "inbound_nodes": [[["conv2d_243", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.slice_1", "trainable": true, "dtype": "float32", "function": "slice"}, "name": "tf.slice_1", "inbound_nodes": [["re_lu_242", 0, 0, {"begin": [0, 0, 0, 0], "size": [-1, 42, -1, -1]}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_243", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_243", "inbound_nodes": [[["batch_normalization_243", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_121", "trainable": true, "dtype": "float32"}, "name": "add_121", "inbound_nodes": [[["tf.slice_1", 0, 0, {}], ["re_lu_243", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_244", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_244", "inbound_nodes": [[["add_121", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_244", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_244", "inbound_nodes": [[["conv2d_244", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_244", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_244", "inbound_nodes": [[["batch_normalization_244", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_16", "inbound_nodes": [[["max_pooling2d_68", 0, 0, {}], ["re_lu_242", 0, 0, {}], ["re_lu_244", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_122", "trainable": true, "dtype": "float32"}, "name": "add_122", "inbound_nodes": [[["concatenate_16", 0, 0, {}], ["concatenate_16", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.negative_18", "trainable": true, "dtype": "float32", "function": "math.negative"}, "name": "tf.math.negative_18", "inbound_nodes": [["concatenate_16", 0, 0, {"name": null}]]}, {"class_name": "Add", "config": {"name": "add_123", "trainable": true, "dtype": "float32"}, "name": "add_123", "inbound_nodes": [[["add_122", 0, 0, {}], ["tf.math.negative_18", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_124", "trainable": true, "dtype": "float32"}, "name": "add_124", "inbound_nodes": [[["add_123", 0, 0, {}], ["add_123", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.negative_19", "trainable": true, "dtype": "float32", "function": "math.negative"}, "name": "tf.math.negative_19", "inbound_nodes": [["add_123", 0, 0, {"name": null}]]}, {"class_name": "Add", "config": {"name": "add_125", "trainable": true, "dtype": "float32"}, "name": "add_125", "inbound_nodes": [[["add_124", 0, 0, {}], ["tf.math.negative_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_245", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_245", "inbound_nodes": [[["add_125", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_245", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_245", "inbound_nodes": [[["conv2d_245", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_245", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_245", "inbound_nodes": [[["batch_normalization_245", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_69", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_69", "inbound_nodes": [[["re_lu_245", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_70", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_70", "inbound_nodes": [[["max_pooling2d_69", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_246", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_246", "inbound_nodes": [[["max_pooling2d_70", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_246", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_246", "inbound_nodes": [[["conv2d_246", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_246", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_246", "inbound_nodes": [[["batch_normalization_246", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_247", "trainable": true, "dtype": "float32", "filters": 43, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_247", "inbound_nodes": [[["re_lu_246", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_247", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_247", "inbound_nodes": [[["conv2d_247", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_248", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_248", "inbound_nodes": [[["add_125", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_247", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_247", "inbound_nodes": [[["batch_normalization_247", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_248", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_248", "inbound_nodes": [[["conv2d_248", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.slice_2", "trainable": true, "dtype": "float32", "function": "slice"}, "name": "tf.slice_2", "inbound_nodes": [["re_lu_247", 0, 0, {"begin": [0, 0, 0, 0], "size": [-1, 42, -1, -1]}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_248", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_248", "inbound_nodes": [[["batch_normalization_248", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_126", "trainable": true, "dtype": "float32"}, "name": "add_126", "inbound_nodes": [[["tf.slice_2", 0, 0, {}], ["re_lu_248", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_249", "trainable": true, "dtype": "float32", "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_249", "inbound_nodes": [[["add_126", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_249", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_249", "inbound_nodes": [[["conv2d_249", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_249", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_249", "inbound_nodes": [[["batch_normalization_249", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_17", "inbound_nodes": [[["max_pooling2d_70", 0, 0, {}], ["re_lu_247", 0, 0, {}], ["re_lu_249", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_127", "trainable": true, "dtype": "float32"}, "name": "add_127", "inbound_nodes": [[["concatenate_17", 0, 0, {}], ["concatenate_17", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.negative_20", "trainable": true, "dtype": "float32", "function": "math.negative"}, "name": "tf.math.negative_20", "inbound_nodes": [["concatenate_17", 0, 0, {"name": null}]]}, {"class_name": "Add", "config": {"name": "add_128", "trainable": true, "dtype": "float32"}, "name": "add_128", "inbound_nodes": [[["add_127", 0, 0, {}], ["tf.math.negative_20", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_11", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_11", "inbound_nodes": [[["add_128", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["global_average_pooling2d_11", 0, 0, {}]]]}], "input_layers": [["input_20", 0, 0]], "output_layers": [["dense_12", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_234/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_234/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_234/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_234/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_235/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_235/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_235/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_235/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_236/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_236/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_236/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_236/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_237/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_237/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_237/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_237/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_238/gamma", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_238/beta", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_238/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_238/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_239/gamma", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_239/beta", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_239/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_239/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_240/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_240/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_240/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_240/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_241/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_241/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_241/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_241/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_242/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_242/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_242/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_242/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_243/gamma", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_243/beta", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_243/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_243/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_244/gamma", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_244/beta", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_244/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_244/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_245/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_245/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_245/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_245/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_246/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_246/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_246/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_246/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_247/gamma", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_247/beta", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_247/moving_mean", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_247/moving_variance", "shape": [43], "dtype": "float32"}, {"name": "batch_normalization_248/gamma", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_248/beta", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_248/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_248/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_249/gamma", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_249/beta", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_249/moving_mean", "shape": [42], "dtype": "float32"}, {"name": "batch_normalization_249/moving_variance", "shape": [42], "dtype": "float32"}, {"name": "conv2d_234/kernel", "shape": [3, 3, 1, 128], "dtype": "float32"}, {"name": "conv2d_235/kernel", "shape": [1, 1, 28, 43], "dtype": "float32"}, {"name": "conv2d_236/kernel", "shape": [1, 1, 43, 43], "dtype": "float32"}, {"name": "conv2d_237/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_238/kernel", "shape": [1, 1, 28, 42], "dtype": "float32"}, {"name": "conv2d_239/kernel", "shape": [1, 1, 42, 42], "dtype": "float32"}, {"name": "conv2d_240/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_241/kernel", "shape": [1, 1, 43, 43], "dtype": "float32"}, {"name": "conv2d_242/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_243/kernel", "shape": [1, 1, 128, 42], "dtype": "float32"}, {"name": "conv2d_244/kernel", "shape": [1, 1, 42, 42], "dtype": "float32"}, {"name": "conv2d_245/kernel", "shape": [1, 1, 128, 43], "dtype": "float32"}, {"name": "conv2d_246/kernel", "shape": [1, 1, 43, 43], "dtype": "float32"}, {"name": "conv2d_247/kernel", "shape": [3, 3, 43, 43], "dtype": "float32"}, {"name": "conv2d_248/kernel", "shape": [1, 1, 128, 42], "dtype": "float32"}, {"name": "conv2d_249/kernel", "shape": [1, 1, 42, 42], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [10], "dtype": "float32"}]}]}