{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_19", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_28"}, "name": "input_28", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_350", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_350", "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_350", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_350", "inbound_nodes": [[["conv2d_350", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_350", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_350", "inbound_nodes": [[["batch_normalization_350", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_180", "trainable": true, "dtype": "float32"}, "name": "add_180", "inbound_nodes": [[["re_lu_350", 0, 0, {}], ["re_lu_350", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_65", "trainable": true, "dtype": "float32"}, "name": "subtract_65", "inbound_nodes": [[["add_180", 0, 0, {}], ["re_lu_350", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_351", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_351", "inbound_nodes": [[["subtract_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_351", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_351", "inbound_nodes": [[["conv2d_351", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_351", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_351", "inbound_nodes": [[["batch_normalization_351", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_352", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_352", "inbound_nodes": [[["re_lu_351", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_352", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_352", "inbound_nodes": [[["conv2d_352", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_352", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_352", "inbound_nodes": [[["batch_normalization_352", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_353", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_353", "inbound_nodes": [[["re_lu_352", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_355", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_355", "inbound_nodes": [[["subtract_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_353", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_353", "inbound_nodes": [[["conv2d_353", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_355", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_355", "inbound_nodes": [[["conv2d_355", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_353", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_353", "inbound_nodes": [[["batch_normalization_353", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_355", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_355", "inbound_nodes": [[["batch_normalization_355", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_356", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_356", "inbound_nodes": [[["subtract_65", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_181", "trainable": true, "dtype": "float32"}, "name": "add_181", "inbound_nodes": [[["re_lu_353", 0, 0, {}], ["re_lu_355", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_356", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_356", "inbound_nodes": [[["conv2d_356", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_354", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_354", "inbound_nodes": [[["re_lu_353", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_101", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_101", "inbound_nodes": [[["add_181", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_356", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_356", "inbound_nodes": [[["batch_normalization_356", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_354", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_354", "inbound_nodes": [[["conv2d_354", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_182", "trainable": true, "dtype": "float32"}, "name": "add_182", "inbound_nodes": [[["max_pooling2d_101", 0, 0, {}], ["re_lu_356", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_354", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_354", "inbound_nodes": [[["batch_normalization_354", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_102", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_102", "inbound_nodes": [[["add_182", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_27", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_27", "inbound_nodes": [[["re_lu_354", 0, 0, {}], ["max_pooling2d_102", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_183", "trainable": true, "dtype": "float32"}, "name": "add_183", "inbound_nodes": [[["concatenate_27", 0, 0, {}], ["concatenate_27", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_66", "trainable": true, "dtype": "float32"}, "name": "subtract_66", "inbound_nodes": [[["add_183", 0, 0, {}], ["concatenate_27", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_184", "trainable": true, "dtype": "float32"}, "name": "add_184", "inbound_nodes": [[["subtract_66", 0, 0, {}], ["subtract_66", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_67", "trainable": true, "dtype": "float32"}, "name": "subtract_67", "inbound_nodes": [[["add_184", 0, 0, {}], ["subtract_66", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_357", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_357", "inbound_nodes": [[["subtract_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_357", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_357", "inbound_nodes": [[["conv2d_357", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_357", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_357", "inbound_nodes": [[["batch_normalization_357", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_358", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_358", "inbound_nodes": [[["re_lu_357", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_358", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_358", "inbound_nodes": [[["conv2d_358", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_358", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_358", "inbound_nodes": [[["batch_normalization_358", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_359", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_359", "inbound_nodes": [[["re_lu_358", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_361", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_361", "inbound_nodes": [[["subtract_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_359", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_359", "inbound_nodes": [[["conv2d_359", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_361", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_361", "inbound_nodes": [[["conv2d_361", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_359", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_359", "inbound_nodes": [[["batch_normalization_359", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_361", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_361", "inbound_nodes": [[["batch_normalization_361", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_362", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_362", "inbound_nodes": [[["subtract_67", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_185", "trainable": true, "dtype": "float32"}, "name": "add_185", "inbound_nodes": [[["re_lu_359", 0, 0, {}], ["re_lu_361", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_362", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_362", "inbound_nodes": [[["conv2d_362", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_360", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_360", "inbound_nodes": [[["re_lu_359", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_103", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_103", "inbound_nodes": [[["add_185", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_362", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_362", "inbound_nodes": [[["batch_normalization_362", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_360", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_360", "inbound_nodes": [[["conv2d_360", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_186", "trainable": true, "dtype": "float32"}, "name": "add_186", "inbound_nodes": [[["max_pooling2d_103", 0, 0, {}], ["re_lu_362", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_360", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_360", "inbound_nodes": [[["batch_normalization_360", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_104", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_104", "inbound_nodes": [[["add_186", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_28", "inbound_nodes": [[["re_lu_360", 0, 0, {}], ["max_pooling2d_104", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_187", "trainable": true, "dtype": "float32"}, "name": "add_187", "inbound_nodes": [[["concatenate_28", 0, 0, {}], ["concatenate_28", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_68", "trainable": true, "dtype": "float32"}, "name": "subtract_68", "inbound_nodes": [[["add_187", 0, 0, {}], ["concatenate_28", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_188", "trainable": true, "dtype": "float32"}, "name": "add_188", "inbound_nodes": [[["subtract_68", 0, 0, {}], ["subtract_68", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_69", "trainable": true, "dtype": "float32"}, "name": "subtract_69", "inbound_nodes": [[["add_188", 0, 0, {}], ["subtract_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_363", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_363", "inbound_nodes": [[["subtract_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_363", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_363", "inbound_nodes": [[["conv2d_363", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_363", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_363", "inbound_nodes": [[["batch_normalization_363", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_364", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_364", "inbound_nodes": [[["re_lu_363", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_364", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_364", "inbound_nodes": [[["conv2d_364", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_364", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_364", "inbound_nodes": [[["batch_normalization_364", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_365", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_365", "inbound_nodes": [[["re_lu_364", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_367", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_367", "inbound_nodes": [[["subtract_69", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_365", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_365", "inbound_nodes": [[["conv2d_365", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_367", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_367", "inbound_nodes": [[["conv2d_367", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_365", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_365", "inbound_nodes": [[["batch_normalization_365", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_367", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_367", "inbound_nodes": [[["batch_normalization_367", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_368", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_368", "inbound_nodes": [[["subtract_69", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_189", "trainable": true, "dtype": "float32"}, "name": "add_189", "inbound_nodes": [[["re_lu_365", 0, 0, {}], ["re_lu_367", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_368", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_368", "inbound_nodes": [[["conv2d_368", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_366", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_366", "inbound_nodes": [[["re_lu_365", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_105", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_105", "inbound_nodes": [[["add_189", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_368", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_368", "inbound_nodes": [[["batch_normalization_368", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_366", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_366", "inbound_nodes": [[["conv2d_366", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_190", "trainable": true, "dtype": "float32"}, "name": "add_190", "inbound_nodes": [[["max_pooling2d_105", 0, 0, {}], ["re_lu_368", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_366", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_366", "inbound_nodes": [[["batch_normalization_366", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_106", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_106", "inbound_nodes": [[["add_190", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_29", "inbound_nodes": [[["re_lu_366", 0, 0, {}], ["max_pooling2d_106", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_191", "trainable": true, "dtype": "float32"}, "name": "add_191", "inbound_nodes": [[["concatenate_29", 0, 0, {}], ["concatenate_29", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_70", "trainable": true, "dtype": "float32"}, "name": "subtract_70", "inbound_nodes": [[["add_191", 0, 0, {}], ["concatenate_29", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_18", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_18", "inbound_nodes": [[["subtract_70", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["global_average_pooling2d_18", 0, 0, {}]]]}], "input_layers": [["input_28", 0, 0]], "output_layers": [["dense_19", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_350/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_350/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_350/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_350/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_351/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_351/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_351/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_351/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_352/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_352/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_352/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_352/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_353/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_353/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_353/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_353/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_354/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_354/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_354/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_354/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_355/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_355/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_355/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_355/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_356/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_356/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_356/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_356/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_357/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_357/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_357/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_357/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_358/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_358/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_358/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_358/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_359/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_359/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_359/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_359/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_360/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_360/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_360/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_360/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_361/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_361/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_361/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_361/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_362/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_362/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_362/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_362/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_363/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_363/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_363/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_363/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_364/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_364/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_364/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_364/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_365/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_365/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_365/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_365/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_366/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_366/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_366/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_366/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_367/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_367/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_367/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_367/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_368/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_368/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_368/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_368/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_350/kernel", "shape": [3, 3, 1, 128], "dtype": "float32"}, {"name": "conv2d_351/kernel", "shape": [1, 1, 28, 64], "dtype": "float32"}, {"name": "conv2d_352/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_353/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_354/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_355/kernel", "shape": [1, 1, 28, 64], "dtype": "float32"}, {"name": "conv2d_356/kernel", "shape": [1, 1, 28, 64], "dtype": "float32"}, {"name": "conv2d_357/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_358/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_359/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_360/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_361/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_362/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_363/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_364/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_365/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_366/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_367/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_368/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [10], "dtype": "float32"}]}]}