{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_12"}, "name": "input_12", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_103", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_103", "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_103", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_103", "inbound_nodes": [[["conv2d_103", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_103", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_103", "inbound_nodes": [[["batch_normalization_103", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_33", "trainable": true, "dtype": "float32"}, "name": "add_33", "inbound_nodes": [[["re_lu_103", 0, 0, {}], ["re_lu_103", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_20", "trainable": true, "dtype": "float32"}, "name": "subtract_20", "inbound_nodes": [[["add_33", 0, 0, {}], ["re_lu_103", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_104", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_104", "inbound_nodes": [[["subtract_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_104", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_104", "inbound_nodes": [[["conv2d_104", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_104", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_104", "inbound_nodes": [[["batch_normalization_104", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_105", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_105", "inbound_nodes": [[["re_lu_104", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_105", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_105", "inbound_nodes": [[["conv2d_105", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_105", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_105", "inbound_nodes": [[["batch_normalization_105", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_106", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_106", "inbound_nodes": [[["re_lu_105", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_106", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_106", "inbound_nodes": [[["conv2d_106", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_106", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_106", "inbound_nodes": [[["batch_normalization_106", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_107", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_107", "inbound_nodes": [[["re_lu_106", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_108", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_108", "inbound_nodes": [[["re_lu_106", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_107", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_107", "inbound_nodes": [[["conv2d_107", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_108", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_108", "inbound_nodes": [[["conv2d_108", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_107", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_107", "inbound_nodes": [[["batch_normalization_107", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_108", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_108", "inbound_nodes": [[["batch_normalization_108", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_34", "trainable": true, "dtype": "float32"}, "name": "add_34", "inbound_nodes": [[["re_lu_106", 0, 0, {}], ["re_lu_107", 0, 0, {}], ["re_lu_108", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_109", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_109", "inbound_nodes": [[["add_34", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_110", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_110", "inbound_nodes": [[["subtract_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_109", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_109", "inbound_nodes": [[["conv2d_109", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_110", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_110", "inbound_nodes": [[["conv2d_110", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_109", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_109", "inbound_nodes": [[["batch_normalization_109", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_110", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_110", "inbound_nodes": [[["batch_normalization_110", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_3", "inbound_nodes": [["re_lu_109", 0, 0, {"y": ["re_lu_110", 0, 0], "name": null}]]}, {"class_name": "Add", "config": {"name": "add_35", "trainable": true, "dtype": "float32"}, "name": "add_35", "inbound_nodes": [[["tf.__operators__.add_3", 0, 0, {}], ["tf.__operators__.add_3", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_21", "trainable": true, "dtype": "float32"}, "name": "subtract_21", "inbound_nodes": [[["add_35", 0, 0, {}], ["tf.__operators__.add_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_36", "trainable": true, "dtype": "float32"}, "name": "add_36", "inbound_nodes": [[["subtract_21", 0, 0, {}], ["subtract_21", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_22", "trainable": true, "dtype": "float32"}, "name": "subtract_22", "inbound_nodes": [[["add_36", 0, 0, {}], ["subtract_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_111", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_111", "inbound_nodes": [[["subtract_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_111", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_111", "inbound_nodes": [[["conv2d_111", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_111", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_111", "inbound_nodes": [[["batch_normalization_111", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_112", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_112", "inbound_nodes": [[["re_lu_111", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_112", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_112", "inbound_nodes": [[["conv2d_112", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_112", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_112", "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_113", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_113", "inbound_nodes": [[["re_lu_112", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_113", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_113", "inbound_nodes": [[["conv2d_113", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_113", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_113", "inbound_nodes": [[["batch_normalization_113", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_114", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_114", "inbound_nodes": [[["re_lu_113", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_115", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_115", "inbound_nodes": [[["re_lu_113", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_114", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_114", "inbound_nodes": [[["conv2d_114", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_115", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_115", "inbound_nodes": [[["conv2d_115", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_114", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_114", "inbound_nodes": [[["batch_normalization_114", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_115", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_115", "inbound_nodes": [[["batch_normalization_115", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_37", "trainable": true, "dtype": "float32"}, "name": "add_37", "inbound_nodes": [[["re_lu_113", 0, 0, {}], ["re_lu_114", 0, 0, {}], ["re_lu_115", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_116", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_116", "inbound_nodes": [[["add_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_117", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_117", "inbound_nodes": [[["subtract_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_116", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_116", "inbound_nodes": [[["conv2d_116", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_117", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_117", "inbound_nodes": [[["conv2d_117", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_116", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_116", "inbound_nodes": [[["batch_normalization_116", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_117", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_117", "inbound_nodes": [[["batch_normalization_117", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_4", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_4", "inbound_nodes": [["re_lu_116", 0, 0, {"y": ["re_lu_117", 0, 0], "name": null}]]}, {"class_name": "Add", "config": {"name": "add_38", "trainable": true, "dtype": "float32"}, "name": "add_38", "inbound_nodes": [[["tf.__operators__.add_4", 0, 0, {}], ["tf.__operators__.add_4", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_23", "trainable": true, "dtype": "float32"}, "name": "subtract_23", "inbound_nodes": [[["add_38", 0, 0, {}], ["tf.__operators__.add_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_39", "trainable": true, "dtype": "float32"}, "name": "add_39", "inbound_nodes": [[["subtract_23", 0, 0, {}], ["subtract_23", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_24", "trainable": true, "dtype": "float32"}, "name": "subtract_24", "inbound_nodes": [[["add_39", 0, 0, {}], ["subtract_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_118", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_118", "inbound_nodes": [[["subtract_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_118", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_118", "inbound_nodes": [[["conv2d_118", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_118", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_118", "inbound_nodes": [[["batch_normalization_118", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_119", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_119", "inbound_nodes": [[["re_lu_118", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_119", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_119", "inbound_nodes": [[["conv2d_119", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_119", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_119", "inbound_nodes": [[["batch_normalization_119", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_120", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_120", "inbound_nodes": [[["re_lu_119", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_120", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_120", "inbound_nodes": [[["conv2d_120", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_120", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_120", "inbound_nodes": [[["batch_normalization_120", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_121", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_121", "inbound_nodes": [[["re_lu_120", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_122", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_122", "inbound_nodes": [[["re_lu_120", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_121", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_121", "inbound_nodes": [[["conv2d_121", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_122", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_122", "inbound_nodes": [[["conv2d_122", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_121", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_121", "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_122", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_122", "inbound_nodes": [[["batch_normalization_122", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_40", "trainable": true, "dtype": "float32"}, "name": "add_40", "inbound_nodes": [[["re_lu_120", 0, 0, {}], ["re_lu_121", 0, 0, {}], ["re_lu_122", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_123", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_123", "inbound_nodes": [[["add_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_124", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_124", "inbound_nodes": [[["subtract_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_123", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_123", "inbound_nodes": [[["conv2d_123", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_124", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_124", "inbound_nodes": [[["conv2d_124", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_123", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_123", "inbound_nodes": [[["batch_normalization_123", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_124", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_124", "inbound_nodes": [[["batch_normalization_124", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_5", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_5", "inbound_nodes": [["re_lu_123", 0, 0, {"y": ["re_lu_124", 0, 0], "name": null}]]}, {"class_name": "Add", "config": {"name": "add_41", "trainable": true, "dtype": "float32"}, "name": "add_41", "inbound_nodes": [[["tf.__operators__.add_5", 0, 0, {}], ["tf.__operators__.add_5", 0, 0, {}]]]}, {"class_name": "Subtract", "config": {"name": "subtract_25", "trainable": true, "dtype": "float32"}, "name": "subtract_25", "inbound_nodes": [[["add_41", 0, 0, {}], ["tf.__operators__.add_5", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_4", "inbound_nodes": [[["subtract_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["global_average_pooling2d_4", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_5", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization_103/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_103/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_103/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_103/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_104/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_104/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_104/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_104/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_105/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_105/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_105/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_105/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_106/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_106/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_106/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_106/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_107/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_107/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_107/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_107/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_108/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_108/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_108/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_108/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_109/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_109/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_109/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_109/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_110/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_110/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_110/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_110/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_111/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_111/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_111/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_111/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_112/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_112/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_112/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_112/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_113/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_113/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_113/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_113/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_114/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_114/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_114/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_114/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_115/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_116/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_117/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_118/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_119/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_120/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_120/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_120/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_120/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_121/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_121/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_121/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_121/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_122/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_122/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_122/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_122/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_123/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_123/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_123/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_123/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_124/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_124/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_124/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_124/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_103/kernel", "shape": [3, 3, 1, 128], "dtype": "float32"}, {"name": "conv2d_104/kernel", "shape": [1, 1, 28, 128], "dtype": "float32"}, {"name": "conv2d_105/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_106/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_107/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_108/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_109/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_110/kernel", "shape": [1, 1, 28, 128], "dtype": "float32"}, {"name": "conv2d_111/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_112/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_113/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_114/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_115/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_116/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_117/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_118/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_119/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv2d_120/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_121/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_122/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_123/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_124/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [10], "dtype": "float32"}]}]}