{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_33", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_34"}, "name": "input_34", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_546", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_546", "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_546", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_546", "inbound_nodes": [[["conv2d_546", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_546", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_546", "inbound_nodes": [[["batch_normalization_546", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_198", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_198", "inbound_nodes": [["re_lu_546", 0, 0, {"name": "input"}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_547", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_547", "inbound_nodes": [[["tf.identity_198", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_547", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_547", "inbound_nodes": [[["conv2d_547", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_547", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_547", "inbound_nodes": [[["batch_normalization_547", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_548", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_548", "inbound_nodes": [[["re_lu_547", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_548", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_548", "inbound_nodes": [[["conv2d_548", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_548", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_548", "inbound_nodes": [[["batch_normalization_548", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_180", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_180", "inbound_nodes": [[["re_lu_548", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_162", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_162", "inbound_nodes": [["re_lu_548", 0, 0, {"y": ["max_pooling2d_180", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_549", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_549", "inbound_nodes": [[["tf.math.add_162", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_549", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_549", "inbound_nodes": [[["conv2d_549", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_549", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_549", "inbound_nodes": [[["batch_normalization_549", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_550", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_550", "inbound_nodes": [[["re_lu_549", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_550", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_550", "inbound_nodes": [[["conv2d_550", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_550", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_550", "inbound_nodes": [[["batch_normalization_550", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_163", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_163", "inbound_nodes": [["max_pooling2d_180", 0, 0, {"y": ["re_lu_550", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_551", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_551", "inbound_nodes": [[["tf.math.add_163", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_551", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_551", "inbound_nodes": [[["conv2d_551", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_551", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_551", "inbound_nodes": [[["batch_normalization_551", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_69", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_69", "inbound_nodes": [[["re_lu_548", 0, 0, {"axis": 1}], ["re_lu_551", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_199", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_199", "inbound_nodes": [["tf.concat_69", 0, 0, {"name": "output"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_200", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_200", "inbound_nodes": [["tf.identity_199", 0, 0, {"name": "input"}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_552", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_552", "inbound_nodes": [[["tf.identity_200", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_552", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_552", "inbound_nodes": [[["conv2d_552", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_552", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_552", "inbound_nodes": [[["batch_normalization_552", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_553", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_553", "inbound_nodes": [[["re_lu_552", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_553", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_553", "inbound_nodes": [[["conv2d_553", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_553", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_553", "inbound_nodes": [[["batch_normalization_553", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_181", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_181", "inbound_nodes": [[["re_lu_553", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_164", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_164", "inbound_nodes": [["re_lu_553", 0, 0, {"y": ["max_pooling2d_181", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_554", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_554", "inbound_nodes": [[["tf.math.add_164", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_554", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_554", "inbound_nodes": [[["conv2d_554", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_554", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_554", "inbound_nodes": [[["batch_normalization_554", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_555", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_555", "inbound_nodes": [[["re_lu_554", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_555", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_555", "inbound_nodes": [[["conv2d_555", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_555", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_555", "inbound_nodes": [[["batch_normalization_555", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_165", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_165", "inbound_nodes": [["max_pooling2d_181", 0, 0, {"y": ["re_lu_555", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_556", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_556", "inbound_nodes": [[["tf.math.add_165", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_556", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_556", "inbound_nodes": [[["conv2d_556", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_556", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_556", "inbound_nodes": [[["batch_normalization_556", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_70", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_70", "inbound_nodes": [[["re_lu_553", 0, 0, {"axis": 1}], ["re_lu_556", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_201", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_201", "inbound_nodes": [["tf.concat_70", 0, 0, {"name": "output"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_202", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_202", "inbound_nodes": [["tf.identity_201", 0, 0, {"name": "input"}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_557", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_557", "inbound_nodes": [[["tf.identity_202", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_557", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_557", "inbound_nodes": [[["conv2d_557", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_557", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_557", "inbound_nodes": [[["batch_normalization_557", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_558", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_558", "inbound_nodes": [[["re_lu_557", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_558", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_558", "inbound_nodes": [[["conv2d_558", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_558", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_558", "inbound_nodes": [[["batch_normalization_558", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_182", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "max_pooling2d_182", "inbound_nodes": [[["re_lu_558", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_166", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_166", "inbound_nodes": [["re_lu_558", 0, 0, {"y": ["max_pooling2d_182", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_559", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_559", "inbound_nodes": [[["tf.math.add_166", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_559", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_559", "inbound_nodes": [[["conv2d_559", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_559", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_559", "inbound_nodes": [[["batch_normalization_559", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_560", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_560", "inbound_nodes": [[["re_lu_559", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_560", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_560", "inbound_nodes": [[["conv2d_560", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_560", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_560", "inbound_nodes": [[["batch_normalization_560", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.add_167", "trainable": true, "dtype": "float32", "function": "math.add"}, "name": "tf.math.add_167", "inbound_nodes": [["max_pooling2d_182", 0, 0, {"y": ["re_lu_560", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_561", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_561", "inbound_nodes": [[["tf.math.add_167", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_561", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_561", "inbound_nodes": [[["conv2d_561", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_561", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_561", "inbound_nodes": [[["batch_normalization_561", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_71", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_71", "inbound_nodes": [[["re_lu_558", 0, 0, {"axis": 1}], ["re_lu_561", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.identity_203", "trainable": true, "dtype": "float32", "function": "identity"}, "name": "tf.identity_203", "inbound_nodes": [["tf.concat_71", 0, 0, {"name": "output"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_33", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_33", "inbound_nodes": [["tf.identity_203", 0, 0, {"axis": [1, 2]}]]}, {"class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_33", "inbound_nodes": [[["tf.math.reduce_mean_33", 0, 0, {}]]]}], "input_layers": [["input_34", 0, 0]], "output_layers": [["dense_33", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_546/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_546/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_546/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_546/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_547/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_547/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_547/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_547/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_548/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_548/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_548/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_548/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_549/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_549/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_549/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_549/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_550/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_550/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_550/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_550/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_551/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_551/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_551/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_551/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_552/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_552/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_552/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_552/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_553/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_553/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_553/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_553/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_554/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_554/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_554/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_554/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_555/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_555/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_555/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_555/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_556/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_556/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_556/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_556/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_557/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_557/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_557/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_557/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_558/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_558/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_558/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_558/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_559/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_559/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_559/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_559/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_560/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_560/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_560/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_560/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_561/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_561/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_561/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_561/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_546/kernel", "shape": [3, 3, 1, 128], "dtype": "float32"}, {"name": "conv2d_547/kernel", "shape": [1, 1, 28, 64], "dtype": "float32"}, {"name": "conv2d_548/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_549/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_550/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_551/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_552/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_553/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_554/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_555/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_556/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_557/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "conv2d_558/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_559/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_560/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_561/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "dense_33/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_33/bias", "shape": [10], "dtype": "float32"}]}]}