{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_21", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_31"}, "name": "input_31", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_383", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_383", "inbound_nodes": [[["input_31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_383", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_383", "inbound_nodes": [[["conv2d_383", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_383", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_383", "inbound_nodes": [[["batch_normalization_383", 0, 0, {}]]]}, {"class_name": "Maximum", "config": {"name": "maximum_6", "trainable": true, "dtype": "float32"}, "name": "maximum_6", "inbound_nodes": [[["re_lu_383", 0, 0, {}], ["re_lu_383", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_384", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_384", "inbound_nodes": [[["maximum_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_386", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_386", "inbound_nodes": [[["maximum_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_388", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_388", "inbound_nodes": [[["maximum_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_384", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_384", "inbound_nodes": [[["conv2d_384", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_386", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_386", "inbound_nodes": [[["conv2d_386", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_388", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_388", "inbound_nodes": [[["conv2d_388", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_384", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_384", "inbound_nodes": [[["batch_normalization_384", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_386", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_386", "inbound_nodes": [[["batch_normalization_386", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_388", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_388", "inbound_nodes": [[["batch_normalization_388", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_385", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_385", "inbound_nodes": [[["re_lu_384", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_387", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_387", "inbound_nodes": [[["re_lu_386", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_389", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_389", "inbound_nodes": [[["re_lu_388", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_390", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_390", "inbound_nodes": [[["maximum_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_385", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_385", "inbound_nodes": [[["conv2d_385", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_387", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_387", "inbound_nodes": [[["conv2d_387", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_389", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_389", "inbound_nodes": [[["conv2d_389", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_390", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_390", "inbound_nodes": [[["conv2d_390", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_385", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_385", "inbound_nodes": [[["batch_normalization_385", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_387", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_387", "inbound_nodes": [[["batch_normalization_387", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_389", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_389", "inbound_nodes": [[["batch_normalization_389", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_390", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_390", "inbound_nodes": [[["batch_normalization_390", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_198", "trainable": true, "dtype": "float32"}, "name": "add_198", "inbound_nodes": [[["re_lu_385", 0, 0, {}], ["re_lu_387", 0, 0, {}], ["re_lu_389", 0, 0, {}], ["re_lu_390", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_391", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_391", "inbound_nodes": [[["add_198", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_391", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_391", "inbound_nodes": [[["conv2d_391", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_391", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_391", "inbound_nodes": [[["batch_normalization_391", 0, 0, {}]]]}, {"class_name": "Maximum", "config": {"name": "maximum_7", "trainable": true, "dtype": "float32"}, "name": "maximum_7", "inbound_nodes": [[["re_lu_391", 0, 0, {}], ["re_lu_391", 0, 0, {}]]]}, {"class_name": "Maximum", "config": {"name": "maximum_8", "trainable": true, "dtype": "float32"}, "name": "maximum_8", "inbound_nodes": [[["maximum_7", 0, 0, {}], ["maximum_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_392", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_392", "inbound_nodes": [[["maximum_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_394", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_394", "inbound_nodes": [[["maximum_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_396", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_396", "inbound_nodes": [[["maximum_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_392", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_392", "inbound_nodes": [[["conv2d_392", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_394", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_394", "inbound_nodes": [[["conv2d_394", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_396", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_396", "inbound_nodes": [[["conv2d_396", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_392", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_392", "inbound_nodes": [[["batch_normalization_392", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_394", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_394", "inbound_nodes": [[["batch_normalization_394", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_396", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_396", "inbound_nodes": [[["batch_normalization_396", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_393", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_393", "inbound_nodes": [[["re_lu_392", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_395", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_395", "inbound_nodes": [[["re_lu_394", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_397", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_397", "inbound_nodes": [[["re_lu_396", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_398", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_398", "inbound_nodes": [[["maximum_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_393", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_393", "inbound_nodes": [[["conv2d_393", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_395", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_395", "inbound_nodes": [[["conv2d_395", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_397", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_397", "inbound_nodes": [[["conv2d_397", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_398", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_398", "inbound_nodes": [[["conv2d_398", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_393", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_393", "inbound_nodes": [[["batch_normalization_393", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_395", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_395", "inbound_nodes": [[["batch_normalization_395", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_397", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_397", "inbound_nodes": [[["batch_normalization_397", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_398", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_398", "inbound_nodes": [[["batch_normalization_398", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_199", "trainable": true, "dtype": "float32"}, "name": "add_199", "inbound_nodes": [[["re_lu_393", 0, 0, {}], ["re_lu_395", 0, 0, {}], ["re_lu_397", 0, 0, {}], ["re_lu_398", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_399", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_399", "inbound_nodes": [[["add_199", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_399", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_399", "inbound_nodes": [[["conv2d_399", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_399", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_399", "inbound_nodes": [[["batch_normalization_399", 0, 0, {}]]]}, {"class_name": "Maximum", "config": {"name": "maximum_9", "trainable": true, "dtype": "float32"}, "name": "maximum_9", "inbound_nodes": [[["re_lu_399", 0, 0, {}], ["re_lu_399", 0, 0, {}]]]}, {"class_name": "Maximum", "config": {"name": "maximum_10", "trainable": true, "dtype": "float32"}, "name": "maximum_10", "inbound_nodes": [[["maximum_9", 0, 0, {}], ["maximum_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_400", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_400", "inbound_nodes": [[["maximum_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_402", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_402", "inbound_nodes": [[["maximum_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_404", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_404", "inbound_nodes": [[["maximum_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_400", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_400", "inbound_nodes": [[["conv2d_400", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_402", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_402", "inbound_nodes": [[["conv2d_402", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_404", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_404", "inbound_nodes": [[["conv2d_404", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_400", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_400", "inbound_nodes": [[["batch_normalization_400", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_402", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_402", "inbound_nodes": [[["batch_normalization_402", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_404", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_404", "inbound_nodes": [[["batch_normalization_404", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_401", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_401", "inbound_nodes": [[["re_lu_400", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_403", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_403", "inbound_nodes": [[["re_lu_402", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_405", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_405", "inbound_nodes": [[["re_lu_404", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_406", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_406", "inbound_nodes": [[["maximum_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_401", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_401", "inbound_nodes": [[["conv2d_401", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_403", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_403", "inbound_nodes": [[["conv2d_403", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_405", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_405", "inbound_nodes": [[["conv2d_405", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_406", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_406", "inbound_nodes": [[["conv2d_406", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_401", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_401", "inbound_nodes": [[["batch_normalization_401", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_403", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_403", "inbound_nodes": [[["batch_normalization_403", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_405", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_405", "inbound_nodes": [[["batch_normalization_405", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_406", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_406", "inbound_nodes": [[["batch_normalization_406", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_200", "trainable": true, "dtype": "float32"}, "name": "add_200", "inbound_nodes": [[["re_lu_401", 0, 0, {}], ["re_lu_403", 0, 0, {}], ["re_lu_405", 0, 0, {}], ["re_lu_406", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_407", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_407", "inbound_nodes": [[["add_200", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_407", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.997, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_407", "inbound_nodes": [[["conv2d_407", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_407", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_407", "inbound_nodes": [[["batch_normalization_407", 0, 0, {}]]]}, {"class_name": "Maximum", "config": {"name": "maximum_11", "trainable": true, "dtype": "float32"}, "name": "maximum_11", "inbound_nodes": [[["re_lu_407", 0, 0, {}], ["re_lu_407", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_20", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d_20", "inbound_nodes": [[["maximum_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["global_average_pooling2d_20", 0, 0, {}]]]}], "input_layers": [["input_31", 0, 0]], "output_layers": [["dense_21", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [[{"class_name": "SparseCategoricalAccuracy", "config": {"name": "sparse_categorical_accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_383/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_383/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_383/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_383/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_384/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_384/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_384/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_384/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_385/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_385/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_385/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_385/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_386/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_386/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_386/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_386/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_387/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_387/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_387/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_387/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_388/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_388/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_388/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_388/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_389/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_389/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_389/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_389/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_390/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_390/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_390/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_390/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_391/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_391/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_391/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_391/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_392/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_392/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_392/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_392/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_393/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_393/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_393/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_393/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_394/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_394/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_394/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_394/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_395/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_395/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_395/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_395/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_396/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_396/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_396/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_396/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_397/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_397/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_397/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_397/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_398/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_398/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_398/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_398/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_399/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_399/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_399/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_399/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_400/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_400/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_400/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_400/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_401/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_401/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_401/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_401/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_402/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_402/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_402/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_402/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_403/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_403/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_403/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_403/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_404/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_404/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_404/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_404/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_405/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_405/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_405/moving_mean", "shape": [128], 